# Ultralytics YOLO 🚀, AGPL-3.0 license
# RT-DETR-l object detection model with P3-P5 outputs. For details see https://docs.ultralytics.com/models/rtdetr

# Parameters
nc: 80  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-cls.yaml' will call yolov8-cls.yaml with scale 'n'
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, HGStem, [32, 48]]  # 0-P2/4
  - [-1, 6, HGBlock, [48, 128, 3]]  # stage 1

  - [-1, 1, DWConv, [128, 3, 2, 1, False]]  # 2-P3/8
  - [-1, 6, HGBlock, [96, 512, 3]]  # stage 2

  - [-1, 1, DWConv, [512, 3, 2, 1, False]]  # 4-P3/16
  - [-1, 6, HGBlock, [192, 1024, 5, True, False]]  # cm, c2, k, light, shortcut
  - [-1, 6, HGBlock, [192, 1024, 5, True, True]]
  - [-1, 6, HGBlock, [192, 1024, 5, True, True]]  # stage 3

  - [-1, 1, DWConv, [1024, 3, 2, 1, False]]  # 8-P4/32
  - [-1, 6, HGBlock, [384, 2048, 5, True, False]]  # stage 4

head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 10 input_proj.2
  - [-1, 1, AIFI, [1024, 8]]

  - [-1, 1, Conv, [512, 1, 1]] # 12
  - [3, 1, Conv, [512, 1, 1]] # 13
  - [[-1, 7, -2], 1, Zoom_cat, []]  # 14 cat backbone P4
  - [-1, 3, RepC3, [256, 0.5]]  # 15

  - [-1, 1, Conv, [256, 1, 1]] # 16
  - [2, 1, Conv, [256, 1, 1]] # 17
  - [[-1, 3, -2], 1, Zoom_cat, []]  # 18  cat backbone P3
  - [-1, 3, RepC3, [256, 0.5]]  # 19 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]] # 20
  - [[-1, 16], 1, Concat, [1]]  # 21 cat head P4
  - [-1, 3, RepC3, [256, 0.5]]  # 22 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]] # 23
  - [[-1, 12], 1, Concat, [1]]  # 24 cat head P5
  - [-1, 3, RepC3, [256, 0.5]]  # 25 (P5/32-large)

  - [[3, 7, 10], 1, ScalSeq, [256]] # 26 args[inchane]
  - [[19, -1], 1, Add, []] # 27

  - [[27, 22, 25], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]]  # Detect(P3, P4, P5)
